# Pandas

형식적으로 서로 다른 여러 가지 유형의 데이터를 공통의 포멧으로 정리

시리즈와 데이터 프레임이라는 구조화된 데이터 형식

## 시리즈

1차원 배열

시리즈 만드는 방법:

pandas.Series(dictionary/list)

In [3]:
import pandas as pd

In [53]:
dict_data = {'a':1, 'b':2, 'c':3}
sr = pd.Series(dict_data)
print(type(sr))
print('\n')
print(sr)

<class 'pandas.core.series.Series'>


a    1
b    2
c    3
dtype: int64

In [54]:
tup_data = ('영인', '2010-05-10', '여', 'True')
sr = pd.Series(tup_data, index=['이름', '생년월일', '성별', '학생여부'])
print(sr)

print(sr[0])
print(sr['이름'])

print(sr[[1,3]])
print(sr[['생년월일','학생여부']])

이름              영인
생년월일    2010-05-10
성별               여
학생여부          True
dtype: object
영인
영인
생년월일    2010-05-10
학생여부          True
dtype: object
생년월일    2010-05-10
학생여부          True
dtype: object

In [55]:
tup_data = ('영인', '2010-05-10', '여', 'True')
sr = pd.Series(tup_data) #index=['이름', '생년월일', '성별', '학생여부'])
print(sr)

0            영인
1    2010-05-10
2             여
3          True
dtype: object

index를 지정하지 않았을 경우 그냥 숫자로 index 표기

## 데이터프레임

2차원 배열

열은 시리즈 객체

각 열은 공통의 속성을 갖는 일련의 데이터를 나타냄

각 행은 개별 관측대상에 대한 다양한 속성 데이터들의 모음인 records

pandas.DataFrame(dictionary, list)

In [56]:
dict_data = {'c0':[1,2,3], 'c1':[4,5,6], 'c2':[7,8,9],'c3':[10,11,12], 'c4':[13,14,15]}

df = pd.DataFrame(dict_data)

print(type(df))
print('\n')
print(df)

<class 'pandas.core.frame.DataFrame'>


   c0  c1  c2  c3  c4
0   1   4   7  10  13
1   2   5   8  11  14
2   3   6   9  12  15

In [57]:
df = pd.DataFrame([[15,'남','덕영중'],[17,'여','수리중']])

print(df)

    0  1    2
0  15  남  덕영중
1  17  여  수리중

In [58]:
df_1 = pd.DataFrame([[15,'남','덕영중'],[17,'여','수리중']], 
                    index=['준서','예은'],
                    columns= ['나이','성별','학교'])

print(df_1)
print(df_1['나이']==15)

    나이 성별   학교
준서  15  남  덕영중
예은  17  여  수리중
준서     True
예은    False
Name: 나이, dtype: bool

In [59]:
df.rename(index={'준서':'학생1'})

    0  1    2
0  15  남  덕영중
1  17  여  수리중

In [60]:
df.index=['준서','학생1']
df=df.rename(columns={'학교':'중학교'})
df

      0  1    2
준서   15  남  덕영중
학생1  17  여  수리중

'inplace = True'를 통해 변경한 값을 바로 저장

In [61]:
df.drop('준서')

      0  1    2
학생1  17  여  수리중

In [62]:
df.drop(1,axis=1)

      0    2
준서   15  덕영중
학생1  17  수리중

axis 기본은 0, 0은 행, 1은 열

loc는 이름을 통해 찾기, iloc는 좌표를 통해 찾는다

In [10]:
exam_data = {'이름': ['서준','우현','인아'],
            '수학':[90,80,70],
            '영어':[98,89,95],
            '음악':[85,95,100],
            '체육':[100,90,90]}
df = pd.DataFrame(exam_data)
df

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90

In [11]:
df=df.set_index('이름')
df

    수학  영어   음악   체육
이름
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [65]:
df['총점']=df['수학']+df['영어']+df['음악']+df['체육']
df

    수학  영어   음악   체육   총점
이름
서준  90  98   85  100  373
우현  80  89   95   90  354
인아  70  95  100   90  355

In [66]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, 서준 to 인아
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   수학      3 non-null      int64
 1   영어      3 non-null      int64
 2   음악      3 non-null      int64
 3   체육      3 non-null      int64
 4   총점      3 non-null      int64
dtypes: int64(5)
memory usage: 144.0+ bytes

In [67]:
df.loc['길동']=[90,90,90,90,90]
df

    수학  영어   음악   체육   총점
이름
서준  90  98   85  100  373
우현  80  89   95   90  354
인아  70  95  100   90  355
길동  90  90   90   90   90

In [68]:
df.T

이름   서준   우현   인아  길동
수학   90   80   70  90
영어   98   89   95  90
음악   85   95  100  90
체육  100   90   90  90
총점  373  354  355  90

df.T 를 사용해서 행과 열을 바꿀 수 있다.

In [69]:
df['평균']=df['총점']/4

df

    수학  영어   음악   체육   총점     평균
이름
서준  90  98   85  100  373  93.25
우현  80  89   95   90  354  88.50
인아  70  95  100   90  355  88.75
길동  90  90   90   90   90  22.50

In [70]:
grades=[]
for row in df['평균']:
    if row >=90:
        grades.append('합격')
    else:
        grades.append('불합격')
df['grades']=grades

In [1]:
df['수학']

NameError: name 'df' is not defined

In [72]:
def scholarship(row):
    print(row)
    if row == '합격':
        return '장학생'
    else:
        return '비장학생'

In [73]:
df.grades = df.grades.apply(scholarship)

합격
불합격
불합격
불합격

In [74]:
df

    수학  영어   음악   체육   총점     평균 grades
이름
서준  90  98   85  100  373  93.25    장학생
우현  80  89   95   90  354  88.50   비장학생
인아  70  95  100   90  355  88.75   비장학생
길동  90  90   90   90   90  22.50   비장학생

In [75]:
csv=pd.read_csv('csv_sample.csv')
csv

   c0   c1   c2   c3
0   0    1    4    7
1   1    2    5    8
2   2    3    6    9

In [78]:
df.to_csv('savetest.csv')

In [85]:
df.to_excel('datatest1.xlsx')

## df1을 'sheet1'으로, df2를 'sheet2'로 저장
writer =

pd.ExcelWriter("data/df_excelwriter.xlsx")

df1.to_excel(writer, sheet_name="sheet1")

df2.to_excel(writer, sheet_name="sheet2")

writer.save()